app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "What colors are the planets?"], ["created_at", "2015-09-29 14:59:13.632960"], ["updated_at", "2015-09-29 14:59:13.632960"]]

  def update
    @question = Question.find(params[:id])
      if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "What colors are all the planets?"], ["updated_at", "2015-09-29 15:16:51.662666"], ["id", 1]]